# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [66]:
import pandas as pd
import numpy as np

In [67]:
from numpy.random import randn
np.random.seed(101)

In [68]:
from numpy.random import randn
np.random.seed(101)

In [69]:
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [71]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [72]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [73]:
df['W','Z']

KeyError: ('W', 'Z')

In [ ]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [ ]:
df[['W','Z','Y']] #para acessar mais de uma coluna é preciso fazer uma lista bidimencional

          W         Z         Y
A  0.230087 -0.166646 -2.052563
B -0.445873  1.523750  2.785010
C  1.290230 -0.240510  0.214234
D -1.420949  0.329784  1.007324
E  0.920525  1.955420 -0.377861

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.230087
B   -0.445873
C    1.290230
D   -1.420949
E    0.920525
Name: W, dtype: float64

DataFrame Columns are just Series

In [ ]:
type(df['W']) # informar tipo de data

pandas.core.series.Series

**Creating a new column:**

In [75]:
df['new'] = df['W'] + df['Y']

In [76]:
df['new2'] = df ['W'] + df['Z']

In [77]:
df

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.210676
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.143752
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.874303

** Removing Columns**

In [78]:
df.drop('new',axis=1) ### axis 0 - eixo x, axis 1 - eixo y

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [79]:
df.drop('new',axis=1)

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [80]:
df.drop('A',axis=0)

          W         X         Y         Z       new      new2
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.143752
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.874303

In [81]:
df #drop nao executou a remoção, só mostrou preview

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.210676
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.143752
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.874303

In [82]:
df

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.210676
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.143752
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.874303

In [83]:
# Not inplace unless specified!
df

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.210676
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.143752
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.874303

In [84]:
df.drop('new',axis=1,inplace=True) #inplace executa a remoção

In [85]:
df.drop('B',inplace=True)

In [86]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

Can also drop rows this way:

In [97]:
df.drop('E',axis=0)

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [98]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

** Selecting Rows**

In [100]:
df.loc['A'] #LOCALIZAR

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new2    3.210676
Name: A, dtype: float64

In [99]:
df.loc['C']

W      -2.018168
X       0.740122
Y       0.528813
Z      -0.589001
new2   -2.607169
Name: C, dtype: float64

In [103]:
df.loc['W'] #Coluna deu erro

KeyError: 'W'

Or select based off of position instead of label

In [104]:
df.iloc[0]

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new2    3.210676
Name: A, dtype: float64

In [106]:
df.iloc[3] #localiza pela posição

W       0.190794
X       1.978757
Y       2.605967
Z       0.683509
new2    0.874303
Name: E, dtype: float64

In [107]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

** Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

-0.8480769834036315

In [109]:
df.loc['A','Z'] #localizes intersection of the collum and the row

0.5038257538223936

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [110]:
df.loc[['D','E'],['W','X']]

          W         X
D  0.188695 -0.758872
E  0.190794  1.978757

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [111]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [113]:
df>0 # retornal onde é maior que zero

       W      X      Y      Z   new2
A   True   True   True   True   True
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [ ]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [114]:
df[df<0]

          W         X         Y         Z      new2
A       NaN       NaN       NaN       NaN       NaN
C -2.018168       NaN       NaN -0.589001 -2.607169
D       NaN -0.758872 -0.933237       NaN       NaN
E       NaN       NaN       NaN       NaN       NaN

In [115]:
df[df['W']>0]

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  3.210676
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [117]:
df['B'] = df['W'] + df['Y']

In [119]:
df

          W         X         Y         Z      new2         B
A  2.706850  0.628133  0.907969  0.503826  3.210676  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -2.607169 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057  1.143752 -0.744542
E  0.190794  1.978757  2.605967  0.683509  0.874303  2.796762

In [120]:
df[df['W']>0]['Y'] #valores de y quando o w é >0

A    0.907969
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [121]:
df[df['W']>0][['Y','X']] #valores de y e x quando w>0

          Y         X
A  0.907969  0.628133
D -0.933237 -0.758872
E  2.605967  1.978757

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

For two conditions you can use | and & with parenthesis:

In [127]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z      new2         B
E  0.190794  1.978757  2.605967  0.683509  0.874303  2.796762

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [128]:
df

          W         X         Y         Z      new2         B
A  2.706850  0.628133  0.907969  0.503826  3.210676  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -2.607169 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057  1.143752 -0.744542
E  0.190794  1.978757  2.605967  0.683509  0.874303  2.796762

In [130]:
# Reset to default 0,1...n index
df.reset_index() #reseta o indice

  index         W         X         Y         Z      new2         B
0     A  2.706850  0.628133  0.907969  0.503826  3.210676  3.614819
1     C -2.018168  0.740122  0.528813 -0.589001 -2.607169 -1.489355
2     D  0.188695 -0.758872 -0.933237  0.955057  1.143752 -0.744542
3     E  0.190794  1.978757  2.605967  0.683509  0.874303  2.796762

In [189]:
newdata = 'CA NY WY OR CO'.split()

In [190]:
newdata

['CA', 'NY', 'WY', 'OR', 'CO']

In [180]:
df.drop('new2',axis=1,inplace=True)

KeyError: "['new2'] not found in axis"

In [191]:
df

          W         X         Y         Z States
0   2.70685  0.628133  0.907969  1.536102     CA
1 -2.018168  0.740122  0.528813  1.268936     NY
2  0.188695 -0.758872 -0.933237 -1.692109     WY
3  0.190794  1.978757  2.605967  4.584725     OR
4        11        22        33        44     CO

In [183]:
new_row = {'W':'11','X':'22','Y':'33','Z':'44'}

In [186]:
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

In [198]:
df

          W         X         Y         Z States
0   2.70685  0.628133  0.907969  1.536102     CA
1 -2.018168  0.740122  0.528813  1.268936     NY
2  0.188695 -0.758872 -0.933237 -1.692109     WY
3  0.190794  1.978757  2.605967  4.584725     OR
4        11        22        33        44     CO

In [199]:
df['States'] = newdata

In [200]:
df

          W         X         Y         Z States
0   2.70685  0.628133  0.907969  1.536102     CA
1 -2.018168  0.740122  0.528813  1.268936     NY
2  0.188695 -0.758872 -0.933237 -1.692109     WY
3  0.190794  1.978757  2.605967  4.584725     OR
4        11        22        33        44     CO

In [201]:
df.set_index('States')

               W         X         Y         Z
States
CA       2.70685  0.628133  0.907969  1.536102
NY     -2.018168  0.740122  0.528813  1.268936
WY      0.188695 -0.758872 -0.933237 -1.692109
OR      0.190794  1.978757  2.605967  4.584725
CO            11        22        33        44

In [202]:
df

          W         X         Y         Z States
0   2.70685  0.628133  0.907969  1.536102     CA
1 -2.018168  0.740122  0.528813  1.268936     NY
2  0.188695 -0.758872 -0.933237 -1.692109     WY
3  0.190794  1.978757  2.605967  4.584725     OR
4        11        22        33        44     CO

In [203]:
df.set_index('States',inplace=True)

In [204]:
df

               W         X         Y         Z
States
CA       2.70685  0.628133  0.907969  1.536102
NY     -2.018168  0.740122  0.528813  1.268936
WY      0.188695 -0.758872 -0.933237 -1.692109
OR      0.190794  1.978757  2.605967  4.584725
CO            11        22        33        44

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']

inside = [1,2,3,4,5,6]

hier_index = list(zip(outside,inside))

hier_index = pd.MultiIndex.from_tuples(hier_index)

In [206]:
outside = ['G1','G1','G1','G2','G2','G2'] # dominador

inside = [1,2,3,4,5,6] #dominado

hier_index = list(zip(outside,inside))

hier_index = pd.MultiIndex.from_tuples(hier_index)

In [208]:
hier_index # tuple is an cartesian coordenate

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 4),
            ('G2', 5),
            ('G2', 6)],
           )

In [221]:
df1 = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [222]:
df1

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 4  0.238127  1.996652
   5 -0.993263  0.196800
   6 -1.136645  0.000366

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [232]:
df1.loc['G2']

                A         B
Numbers
4        0.238127  1.996652
5       -0.993263  0.196800
6       -1.136645  0.000366

In [233]:
df1.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [234]:
df1.loc['G1'].loc[[1,3]]

                A         B
Numbers
1       -0.497104 -0.754070
3       -0.116773  1.901755

In [229]:
df1.index.names

FrozenList([None, None])

In [230]:
df1.index.names = ['Group','Numbers']

In [231]:
df1

                      A         B
Group Numbers
G1    1       -0.497104 -0.754070
      2       -0.943406  0.484752
      3       -0.116773  1.901755
G2    4        0.238127  1.996652
      5       -0.993263  0.196800
      6       -1.136645  0.000366

In [ ]:
df1

                      A         B
Group Numbers
G1    1        0.302665  1.693723
      2       -1.706086 -1.159119
      3       -0.134841  0.390528
G2    4        0.166905  0.184502
      5        0.807706  0.072960
      6        0.638787  0.329646

In [238]:
df1.loc['G2']

                A         B
Numbers
4        0.238127  1.996652
5       -0.993263  0.196800
6       -1.136645  0.000366

In [239]:
df1.xs('G1')

                A         B
Numbers
1       -0.497104 -0.754070
2       -0.943406  0.484752
3       -0.116773  1.901755

In [240]:
df1.xs(('G1',1))

A   -0.497104
B   -0.754070
Name: (G1, 1), dtype: float64

In [ ]:
df1

                      A         B
Group Numbers
G1    1        0.302665  1.693723
      2       -1.706086 -1.159119
      3       -0.134841  0.390528
G2    4        0.166905  0.184502
      5        0.807706  0.072960
      6        0.638787  0.329646

In [250]:
df1.xs(2,level="Numbers") #acess information from a subindex

              A         B
Group
G1    -0.943406  0.484752

In [257]:
df1

                      A         B
Group Numbers
G1    1       -0.497104 -0.754070
      2       -0.943406  0.484752
      3       -0.116773  1.901755
G2    4        0.238127  1.996652
      5       -0.993263  0.196800
      6       -1.136645  0.000366

In [254]:
df1.xs('G2') #acess information from a subindex

                A         B
Numbers
4        0.238127  1.996652
5       -0.993263  0.196800
6       -1.136645  0.000366

In [256]:
df1.xs(('G2',4))

A    0.238127
B    1.996652
Name: (G2, 4), dtype: float64

In [258]:
fora = ['a1','b1','c1','a2','b2','c2']

dentro = ['enzo','paolla','gustavo','luana','pedro','deus']

hier_in= list(zip(fora,dentro))
hier_in = pd.MultiIndex.from_tuples(hier_in)

In [259]:
hier_in

MultiIndex([('a1',    'enzo'),
            ('b1',  'paolla'),
            ('c1', 'gustavo'),
            ('a2',   'luana'),
            ('b2',   'pedro'),
            ('c2',    'deus')],
           )

In [263]:
df2 = pd.DataFrame(np.random.randn(6,6),index=hier_in,columns=['A','B','C','D','E','F'])

In [264]:
df2

                   A         B         C         D         E         F
a1 enzo     0.975720 -0.388239  0.783316 -0.708954  0.586847 -1.621348
b1 paolla   0.677535  0.026105 -1.678284  0.333973 -0.532471  2.117727
c1 gustavo  0.197524  2.302987  0.729024 -0.863091  0.305632  0.243178
a2 luana    0.864165 -1.560931 -0.251897 -0.578120  0.236996  0.200780
b2 pedro    0.327845  0.674485 -0.174057  0.780140 -0.383258 -0.409318
c2 deus     0.343539  0.196275 -0.982776  2.231555 -0.971393 -1.522333